techtest/app/controllers/books_controller.rb

  def index
    @books = Book.includes(:reservations)
    @books = @books.where(status: params[:status]) if params[:status].present?
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."book_id" IN (1, 2, 3)
SELECT "books".* FROM "books"
SELECT "books".* FROM "books" WHERE "books"."status" = 'available'

  def reserve
    @book = Book.find(params[:id])

    if @book.status == "reserved"
      render json: { error: "Book is already reserved" }, status: :unprocessable_entity
      return
    end

    if params[:email].blank?
      render json: { error: "Email is required" }, status: :unprocessable_entity
      return
    end

    reservation = @book.reservations.new(email: params[:email], status: "reserved")

    if reservation.save
      @book.update!(status: "reserved")
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 457185008], ["LIMIT", 1]]
INSERT INTO "reservations" ("book_id", "email", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["book_id", 349599371], ["email", "[FILTERED]"], ["status", "reserved"], ["created_at", "2026-02-24 21:21:38.409684"], ["updated_at", "2026-02-24 21:21:38.409684"]]
UPDATE "books" SET "status" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["status", "reserved"], ["updated_at", "2026-02-24 21:21:38.417210"], ["id", 349599371]]